20240725T004051--kdoc-207-『unix考古学』__book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-03T18:42:32Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 207: 『Unix考古学』</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 207: 『Unix考古学』</h1>
<div id="outline-container-org5b98b6c" class="outline-2">
<h2 id="org5b98b6c"><a href="#org5b98b6c">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org5b98b6c">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-07-31 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-08-03 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5d94563" class="outline-2">
<h2 id="org5d94563"><a href="#org5d94563">概要</a></h2>
<div class="outline-text-2" id="text-org5d94563">
<p>
<a href="https://www.amazon.co.jp/Unix%E8%80%83%E5%8F%A4%E5%AD%A6-Truth-Legend-%E8%97%A4%E7%94%B0-%E6%98%AD%E4%BA%BA/dp/4048930508">Unix考古学 Truth of the Legend</a>はUnix開発の歴史についての本。
</p>
</div>
</div>
<div id="outline-container-org227982e" class="outline-2">
<h2 id="org227982e"><a href="#org227982e">メモ</a></h2>
<div class="outline-text-2" id="text-org227982e">
<ul class="org-ul">
<li>Multicsプロジェクトが終わり、予算もつかなくなった。プロジェクトは高価なマシンを調達できなくなった。そのような状況で、当時まだ若手のデニス・リッチーとケン・トンプソンは手近なPDP-7でゲームを移植した。PDP-7は周辺機器として購入されていたので、CPU時間は無料だった。ゲーム移植の一連の作業でPDP-7のプログラミングに慣れてきたため、ファイルシステムをPDP-7上に実装し始めた。この時点ではまだ、プライベートプロジェクトであった</li>
<li>Ken ThompsonとDennis Ritchie の功績は非常に有名だが、はじまりは悲惨なものだった。 Multics Projectという「失敗プロジェクト」に加担していたからである(p49)</li>
<li>活躍の初期において本業にツイていなかったKen Thompsonだが、Space Travelに関しては誰も使っていなかった「PDP-7」を見つけられたのは幸運だった(p53)</li>
<li>Ken ThompsonはPDP-7上にFORTRANを実装することを宣言した。しかし結局はFORTRANと全く別の言語になり、「B」と呼ばれる言語になった。旧来との主たる違いは表記法で、C言語と通ずるものがある。しかし機能的に目立ったものはなかったようだ。少なくともこの時点で、Ken Thompsonはプログラミング言語を設計すること自体にはそれほど興味がなかったようだ(p61)</li>
<li>PDP-7 Unixの実装には明確な目標があったわけではなく、まともなコンピュータを手に入れるまでの代替処置的な手段として開発されたと推測できる(p64)</li>
<li>Unixのパスワードファイルに「GECOSフィールド」という項目がある。これは、かつてのUnixマシンからGECOSマシンにプリンタ出力やバッチ処理要求を送信する際、ユーザ識別のために付加された情報に由来している(p66)</li>
<li>Joe Ossannaの提案した「文書処理システム」は、実に都合のよい玉虫色の研究テーマであった。マシンの調達と、OSに関する研究の言い訳ができるようになった(p76)</li>
<li>Ken Thompsonは学生時代にQEDに正規表現の機能を実装しており、さらに実装に使用した正規表現を機械語にコンパイルするアルゴリズムについて論文を書き、特許も取得していた(p83)</li>
<li>Unixの &ldquo;Small is Beautiful&rdquo;な哲学は、Multicsの開発に対する反省から生まれた(p97)</li>
<li>yaccはB言語のコンパイラのために作られた(p106)</li>
<li>初期のC言語の開発での最大の目標は、「UnixカーネルをC言語で書き直すこと」であった。つまりカーネルを記述するために必要な機能が、すべてサポートされていることがゴールであった(p116)</li>
<li>UnixもC言語も初期は一人で担当できるくらい十分に小さかった</li>
<li>OSとしてのポータビリティのなさがTENEXを36ビットアーキテクチャに埋没させ、はどウェアの死滅の道連れにさせたと考えられる(p146)</li>
<li>1973年のThird Edition Unixは、OSとしては「ちょっと目立つニューカマー」でしかなかった(p146)</li>
<li>AT&amp;Tのサポートする気のなさは、結果的に協力なUnixユーザコミュニティを形成させる直接的な原因となった。いずれのユーザも「手元にあるのはソースコードだけ」という状態だったので、当初はそこから学び取った情報をユーザ同士で共有するという自己防衛的な発送でユーザの相互扶助が成立していた(p152)</li>
<li>PCCの開発者であるSteve Johnsonは周囲の期待に応えてコンパイラにかかわる作業を長年続けていた。後に彼は「個人的にそれほど関心のあるテーマではなかった」という(p173)</li>
<li>PCCの機能改善を行うために前段の構文パーサーが開発された。その過程で、Cプログラムの構文チェッカー&ldquo;lint&rdquo;が生まれた。当時はコマンドの名前に4文字しか使用できなかった(p175)</li>
<li>「カーネルも単なるプログラムの1つである」という考え方こそが、Unixがポータビリティを獲得したブレークスルーであった。カーネルをここまで簡単に取り扱えるように設計されたOSは、Unix以前には皆無だった(p176)</li>
<li>ポータビリティのためのカーネル修正作業における成果の1つが、現代のC言語ユーザには当たり前とされている「システムコールの戻り値の一貫性」である(p177)</li>
<li>1970年代は16進数表記が一般的でなかった。1980年代になると16進数に慣れ親しむ人が増えていった(p179)</li>
<li>32ビットへの対応はUnixが「ミニコンのOS」から「汎用OS」へと進化したことを意味した(p180)</li>
<li>Seventh Edition Unixのリリースは、1980年代に起こるUnixブームの準備を整えた。いっぽうで「Unixの青春時代の終わり」を告げるものでもあった。Seventh Editionがリリースされたころ、AT&amp;TはUnixを製品化し、コンピュータビジネスに参入することを表明した。そして、Seventh Edition Unix以降のUnixライセンスにはAT&amp;TのUnixビジネスの妨げにならないように多くの制約が加えられるようになった(p181)</li>
<li>データベースシステムOracleの最初のバージョンはPDP-11上でアセンブラを使って書かれた(p194)</li>
<li>代表的なUnixコマンドが出揃ったのは、Seventh Edition Unix以降のことである(p197)</li>
<li><a href="20230618212344-rfc.html#ID-ec870135-b092-4635-8f8e-74a5411bb779">RFC</a>はIMPを介してARPANETサイト間で共有されたメモランダムが始まりである(p277)</li>
<li>コンピュータサイエンスの分野でも、それまで先駆的研究の守護者として存在していたARPAが消滅することにより、民間活力による自律的・継続的な技術革新が促されることになる(p282)</li>
<li>UCBの4BSDはARPANETの研究開発そのもののためではなく、研究成果であるTCP/IPのプロモーションのために開発された(p293)</li>
<li>新しいttyドライバのおかげで、BSD Unixにはビデオターミナルを前提とした高機能のターミナルインターフェースが実現された。Seventh Edition Unixのttyドライバは1文字削除時にエコーバックが出ないなどあまり優しくないインターフェースだった。ttyドライバによって、現在使われるようなCUIと同じような挙動をするようになった(p310)</li>
<li id="セカンドシステム症候群">『人月の神話』で紹介されている事例。人間が設計する2番目のシステムは一般に作り込みすぎてしまう傾向があるため、もっとも危険なシステムになってしまう、という(p388)</li>
<li>「いったいPCとは何をするための道具なのか」といった哲学的な問題を考えると、答えられる人は少ない。PCというキーワードがなかったらどう説明するか。これは1970年代末、マイクロプロセッサに関わる多くの人々共通の悩みであった。マイクロプロセッサの可能性や将来性について、彼らは直感的によく理解できていた。しかしそれを理解できない人に説明するのは難題であった。パーソナルコンピュータというコンセプトが当時は存在しなかった(p396)</li>
<li>Unixの配布元のAT&amp;Tは望んでソースコードの配布を行ったわけではない。当時AT&amp;Tはアメリカ国内の電信電話市場を事実上独占する公益事業を営む企業で、別の業界への参入を禁止されていた(p420)</li>
<li>Microsoftは1979年にUnixライセンスを取得し、自社の製品(XENIX)として拡張して販売していた(p431)</li>
<li>Richard Stallmanは、生活費を稼ぐために年に数ヶ月だけ行方不明になることがあった(p469)</li>
</ul>
</div>
</div>
<div id="outline-container-orgf320f5f" class="outline-2">
<h2 id="orgf320f5f"><a href="#orgf320f5f">関連</a></h2>
<div class="outline-text-2" id="text-orgf320f5f">
<ul class="org-ul">
<li><a href="https://ja.wikipedia.org/wiki/Text_Editor_and_Corrector">Text Editor and Corrector - Wikipedia</a></li>
<li><a href="https://www.issoh.co.jp/column/details/2684/#:~:text=%E3%82%BB%E3%82%AB%E3%83%B3%E3%83%89%E3%82%B7%E3%82%B9%E3%83%86%E3%83%A0%E7%97%87%E5%80%99%E7%BE%A4%E3%81%AF%E3%80%81%E3%82%B7%E3%82%B9%E3%83%86%E3%83%A0,%E3%81%93%E3%81%A8%E3%81%8C%E5%A4%9A%E3%81%84%E3%81%AE%E3%81%A7%E3%81%99%E3%80%82">セカンドシステム症候群とは何か？その原因と解決方法 | 株式会社一創</a></li>
<li><a href="https://ja.wikipedia.org/wiki/XENIX">XENIX - Wikipedia</a></li>
<li><a href="20240210T200104--kdoc-85-元気に動くunix-on-pdp-7を見て連綿と続く歴史を感じた__essay.html#ID-20240210T200104">KDOC 85: 元気に動くUnix on PDP-7を見て連綿と続く歴史を感じた</a>。動いているマシンを見ることで、より理解が進む</li>
</ul>
</div>
</div>
<div id="outline-container-org2d5a17d" class="outline-2">
<h2 id="org2d5a17d"><a href="#org2d5a17d">Backlinks</a></h2>
<div class="outline-text-2" id="text-org2d5a17d">
<ul class="org-ul">
<li><a href="./20240729T234009--kdoc-209-新しいものを生み出すためには詳しくなければならない__essay.html">KDOC 209: 新しいものを生み出すためには詳しくなければならない</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
